[
  {
    "title": "Season 2024-25 Registration Now Open",
    "excerpt": "Get ready for another exciting season with The Crocs! Registration is now open for all grades and age groups.",
    "date": "2024-09-15",
    "category": "Registration",
    "featured": true,
    "content": "We're excited to announce that registration for the 2024-25 cricket season is now officially open! Whether you're a returning player or looking to join our cricket family for the first time, we have options for all skill levels and age groups.\n\nNew players receive a comprehensive welcome package including club merchandise and training resources. Early bird registration discounts are available until October 1st.\n\nFor more information about registration fees, training schedules, and team placements, please contact our membership coordinator.",
    "slug": "season-2024-25-registration-open"
  },
  {
    "title": "Crocs Dominate in Weekend Grand Final",
    "excerpt": "Our A-grade team secured a thrilling victory in last weekend's grand final, capping off an incredible season.",
    "date": "2024-03-18",
    "category": "Match Results",
    "featured": true,
    "content": "In a nail-biting finish at Marrara Cricket Ground, The Crocs A-grade team claimed the championship title with a 6-wicket victory over rivals Northern Sharks.\n\nChasing 287, our batsmen showed incredible composure under pressure. Captain Jake Thompson led from the front with a brilliant 89 not out, while newcomer Sarah Mitchell contributed a crucial 45 in the middle order.\n\nThe bowling attack was equally impressive throughout the finals series, with spinner Mark Roberts taking 4/32 in the grand final. This marks our third championship in five years.",
    "slug": "crocs-grand-final-victory"
  },
  {
    "title": "Junior Development Program Launches",
    "excerpt": "We're proud to announce the launch of our expanded junior development program, welcoming players aged 8-16.",
    "date": "2024-02-22",
    "category": "Youth Cricket",
    "featured": false,
    "content": "The Crocs are committed to nurturing the next generation of cricket talent with our comprehensive junior development program.\n\nThe program includes:\n- Weekly training sessions with qualified coaches\n- Modified game formats suited to different age groups\n- Equipment loan program for new players\n- Pathway to senior cricket\n\nTrained volunteers and professional coaching staff ensure every young player receives quality instruction in a safe, supportive environment.",
    "slug": "junior-development-program-launch"
  },
  {
    "title": "New Pavilion Construction Begins",
    "excerpt": "Construction has commenced on our new club pavilion, featuring modern facilities and improved spectator areas.",
    "date": "2024-01-10",
    "category": "Club Development",
    "featured": false,
    "content": "After years of planning and fundraising, we're thrilled to see construction begin on our new pavilion at Marrara Cricket Ground.\n\nThe new facility will include:\n- Modern change rooms with shower facilities\n- Expanded social area and kitchen\n- Improved accessibility features\n- Enhanced spectator viewing areas\n- Equipment storage and meeting rooms\n\nCompletion is scheduled for the start of the 2024-25 season. We thank all members and sponsors who made this project possible.",
    "slug": "new-pavilion-construction-begins"
  },
  {
    "title": "Community Cricket Clinic Success",
    "excerpt": "Our free community cricket clinic attracted over 50 participants, introducing newcomers to the wonderful game of cricket.",
    "date": "2023-11-28",
    "category": "Community Events",
    "featured": false,
    "content": "The Crocs hosted a fantastic community cricket clinic that brought together cricket enthusiasts of all ages and backgrounds.\n\nParticipants learned basic skills including:\n- Batting techniques and stance\n- Bowling action and accuracy\n- Fielding positions and catches\n- Cricket rules and strategies\n\nMany attendees expressed interest in joining the club, and we're excited to welcome new members to our cricket family. Plans are already underway for our next community event.",
    "slug": "community-cricket-clinic-success"
  }
]